---
type: CategorySet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CategorySet

`Autodesk.Revit.DB.CategorySet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CategorySet | — | `public CategorySet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Category item )` |
| Method | Erase | — | `public virtual int Erase ( Category item )` |
| Method | ForwardIterator | — | `public virtual CategorySetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Category item )` |
| Method | ReverseIterator | — | `public virtual CategorySetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |